// Написати програму, яка визначає, чи є введене число парним або непарним.

// Кроки для виконання завдання:

// - Введення числа:
// Використайте prompt для введення числа користувачем.

// - Перетворення введених даних на число:
// Перетворіть введене значення з рядка на число, використовуючи parseInt або Number.

// - Перевірка введених даних:
// Переконайтеся, що користувач ввів коректне число.

// - Перевірка на парність:
// Використайте оператор залишку від ділення (%), щоб визначити, чи є число парним або непарним.

// - Виведення результату:
// Використайте alert для виведення повідомлення про те, чи є число парним або непарним.

let value = parseInt(prompt("enter any number"));

if (typeof value === "number" && !isNaN(value)) {
  if (value % 2 === 0) {
    alert("The entered value is even");
  } else {
    alert("The entered value is odd");
  }
} else {
  alert("Please enter a number");
};


